export const validationMessages = {
  empty: {
    username: 'نام کاربری الزامیست',
    password: 'رمز عبور الزامیست',
    repeatPassword: 'تکرار رمز عبور الزامیست',
    refreshToken: 'توکن بازیابی الزامیست',
    phoneNumber: 'شماره موبایل الزامیست',
    email: 'آدرس ایمیل الزامیست',
    code: 'کد یکبار مصرف الزامیست',
    articleTitle: 'عنوان برای پست الزامیست',
    articleBody: 'متن بدنه برای پست الزامیست',
    categoryId: 'حداقل یک مورد از لیست ها برای پست جدید باید انتخاب شود',
    articleBanner: 'انتخاب تصویر برای پست الزامیست',
    avatar: 'انتخاب تصویر پروفایل الزامیست',
  },
  length: {
    usernameShort: 'نام کاربری باید حداقل شامل ۴ حرف باشد',
    usernameLong: 'نام کاربری باید حداکثر شامل ۲۰ حرف باشد',
    bioShort: 'متن معرفی شما باید حداقل شامل ۴ حرف باشد',
    bioLong: 'متن معرفی شما باید حداکثر شامل ۱۵۰ حرف باشد',
    displayNameShort: 'نام نمایشی شما باید حداقل شامل ۴ حرف باشد',
    displayNameLong: 'نام نمایشی شما باید حداکثر شامل ۵۰ حرف باشد',
    selectedCategories: 'حداقل یک مورد از لیست ها باید انتخاب شده باشد',
  },
  invalid: {
    username: 'نام کاربری شامل حروف انگلیسی و اعداد می باشد',
    phoneNumber: 'شماره موبایل وارد شده معتبر نیست',
    email: 'آدرس ایمیل وارد شده معتبر نیست',
    code: 'کد یکبار مصرف معتبر نیست',
    password: 'رمزعبور باید حداقل شامل حروف و عدد به طول ۸ کاراکتر باشد',
    repeatPassword: 'رمز عبور و تکرار آن با هم برار نیستند',
  },
};

export const exceptionMessages = {
  exist: {
    user: 'کاربر از قبل وجود دارد',
    mobile: 'شماره موبایل مورد نظر قبلا استفاده شده است',
    sameMobile: 'شماره موبایل مورد نظر را قبلا ثبت کرده اید',
    email: 'ایمیل مورد نظر قبلا استفاده شده است',
    sameEmail: 'ایمیل مورد نظر را قبلا ثبت کرده اید',
    articleTitle: 'یک پست با عنوان مورد نظر از قبل وجود دارد',
  },
  notFound: {
    user: 'کاربر مورد نظر پیدا نشد',
    category: 'لیست مورد نظر یافت نشد',
    article: 'پست مورد نظر یافت نشد',
  },
  invalid: {
    jwt: 'دسترسی شما نامعتبر است. لطفا مجدد لاگین کنید',
    code: 'کد وارد شده معتبر نیست',
    imageFileFormat:
      'فرمت فایل انتخاب شده صحیح نمی باشد لطفا یک فایل تصویر انتخاب کنید',
  },
  notAcceptable: {
    code: 'تا زمان پایان اعتبار کد ارسال شده منتظر بمانید',
  },
  serverError: {
    internal: 'خطایی در سرور رخ داده است',
  },
  permission: {
    main: 'شما دسترسی لازم برای این عملیات را ندارید',
  },
};

export const systemMessage = {
  emailSubject: 'کد تایید Articlesland',
};
